package com.ward_n6.entity.people;

public class Volunteer { // класс волонтёра, возможно он должен быть интерфейсом
    // метод добавление усыновителя в БД - где берём учётные данные?
    // создание листа питомцев усыновителя: можно задействовать енум питомцев, ограничить количество питомцев, например, не более 5
    // метод беседы с усыновителем
    // номер телефона как ID ????
    // метод просмотр отчётов
    // отслеживание испыт. срока

    // выдаёт рекомендации по содержанию - это будет отдельный файл (?), с которого будут считываться рекомендации,
    //наверное, не очень логично писать текст прямо внутри метода
}
